Revit 2027 API
FamilySymbol.GetThermalProperties Method
 Gets the thermal properties for the given FamilySymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyThermalProperties GetThermalProperties()
Public Function GetThermalProperties As FamilyThermalProperties
public:
FamilyThermalProperties^ GetThermalProperties()
member GetThermalProperties : unit -> FamilyThermalProperties
Return Value
FamilyThermalProperties
 The thermal properties. null if the family symbol does not contain thermal properties.
Remarks
 Doors, windows, and curtain wall panels will have thermal properties.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace